---
kind: method
id: M:Autodesk.Revit.DB.GeometryInstance.GetDocument
source: html/090ee075-cff2-fd8d-5a1a-6c79a7c50a4b.htm
---
# Autodesk.Revit.DB.GeometryInstance.GetDocument Method

Gets the document that contains the symbol of this instance.

## Syntax (C#)
```csharp
public Document GetDocument()
```

## Returns
Returns the document that contains the symbol of this instance.